emacs/.config/emacs/my-init.org
* Load packages and modules
Require all of the modules and custom packages tangled to their files
in tony-lisp / tony-emacs-modules directories throughout this literate
config

#+begin_src emacs-lisp :tangle "init.el" :mkdirp yes
  (mapc
   (lambda (string)
     (add-to-list 'load-path (locate-user-emacs-file string)))
   '("tony-lisp" "tony-emacs-modules"))

  (require 'tony-emacs-miscellaneous)
  (require 'tony-emacs-visual-fill-column)
  (require 'tony-emacs-org)
  (require 'tony-emacs-project)
  ;;(require 'tony-emacs-treemacs)
  (require 'tony-emacs-pulsar)
  (require 'tony-emacs-fonts)
  (require 'tony-emacs-nerd-icons)
  (require 'tony-emacs-tweakers)
  (require 'tony-emacs-meow)
  (require 'tony-emacs-which-key)
  ;;(require 'tony-emacs-prot-themes)
  ;;(require 'tony-emacs-doom-themes)
  ;;(require 'tony-emacs-solaire-mode)
  (require 'tony-emacs-themes)
  (require 'tony-emacs-doom-modeline)
  ;(require 'tony-emacs-textsize)
  (require 'tony-emacs-vertico)
  (require 'tony-emacs-marginalia)
  (require 'tony-emacs-orderless)
  (require 'tony-emacs-consult)
  (require 'tony-emacs-diff-hl)
  (require 'tony-emacs-magit)
  (require 'tony-emacs-blamer)
  (require 'tony-emacs-denote)
  (require 'tony-emacs-completion)
  (require 'tony-emacs-spellchecker)
  (require 'tony-emacs-linter)
  (require 'tony-emacs-prettier)
  (require 'tony-emacs-treesit)
  (require 'tony-emacs-languages)
  (require 'tony-emacs-lsp-mode)
  ;;(require 'tony-emacs-lsp-treemacs)
  (require 'tony-emacs-ngx)
  (require 'tony-emacs-lsp-biome)
  (require 'tony-emacs-info-manuals)
  (require 'tony-emacs-copilot)
  (require 'tony-emacs-agent-shell)
  (require 'tony-emacs-agent-shell-sidebar)
#+end_src

* Packages
** ~ngxhtml-ts-mode.el~
#+begin_src emacs-lisp :tangle "tony-lisp/ngxhtml-ts-mode.el" :mkdirp yes
;;; ngxhtml-ts-mode.el --- tree-sitter support for NGXHTML  -*- lexical-binding: t; -*-

;; Took this from github.com/yolksys

;; Copyright (C) 2023-2025 Free Software Foundation, Inc.

;; Author     : cyf <theo@thornhill.no>
;; Maintainer : yf <theo@thornhill.no>
;; Created    : January 2025
;; Keywords   : ngxhtml languages tree-sitter

;; This file is not part of GNU Emacs.

;; This file is free software

;; GNU Emacs is free software: you can redistribute it and/or modify
;; it under the terms of the GNU General Public License as published by
;; the Free Software Foundation, either version 3 of the License, or
;; (at your option) any later version.

;; GNU Emacs is distributed in the hope that it will be useful,
;; but WITHOUT ANY WARRANTY; without even the implied warranty of
;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
;; GNU General Public License for more details.

;; You should have received a copy of the GNU General Public License
;; along with GNU Emacs.  If not, see <https://www.gnu.org/licenses/>.

;;; Commentary:
;;

;;; Code:

(require 'treesit)
(require 'sgml-mode)

(if (not treesit-load-name-override-list)
    (setq treesit-load-name-override-list
          '((ngxhtml "libtree-sitter-angular" "tree_sitter_angular")))
  (add-to-list
   treesit-load-name-override-list
   '(ngxhtml "libtree-sitter-angular" "tree_sitter_angular")))

;;;for ngxhtml start
(defgroup ngx-group nil
  "ngx group")

(defface ngx-control-face
  '((((class color) (min-colors 88) (background light))
     :foreground "#D73A49")
    (((class color) (min-colors 88) (background dark))
     :foreground "#F97583")
    (((class color) (min-colors 16) (background light))
     :foreground "#D73A49")
    (((class color) (min-colors 16) (background dark))
     :foreground "#F97583")
    (((class color) (min-colors 8))
     :background "green"
     :foreground "black")
    (t :inverse-video t))
  "Basic face for ngx."
  :group 'ngx-group)

(defface ngx-pipe-face
  '((((class color) (min-colors 88) (background light))
     :foreground "#6F42C1")
    (((class color) (min-colors 88) (background dark))
     :foreground "#B392F0")
    (((class color) (min-colors 16) (background light))
     :foreground "#6F42C1")
    (((class color) (min-colors 16) (background dark))
     :foreground "#B392F0")
    (((class color) (min-colors 8))
     :background "green"
     :foreground "black")
    (t :inverse-video t))
  "Basic face for ngx."
  :group 'ngx-group)

(defface ngx-bind-face
  '((((class color) (min-colors 88) (background light))
     :foreground "#6F42C1")
    (((class color) (min-colors 88) (background dark))
     :foreground "#8514f5")
    (((class color) (min-colors 16) (background light))
     :foreground "#6F42C1")
    (((class color) (min-colors 16) (background dark))
     :foreground "#8514f5")
    (((class color) (min-colors 8))
     :background "green"
     :foreground "black")
    (t :inverse-video t))
  "Basic face for ngx."
  :group 'ngx-group)

(defface ngx-id-face
  '((((class color) (min-colors 88) (background light))
     :foreground "#22863A")
    (((class color) (min-colors 88) (background dark))
     :foreground "#85E89D")
    (((class color) (min-colors 16) (background light))
     :foreground "#22863A")
    (((class color) (min-colors 16) (background dark))
     :foreground "#85E89D")
    (((class color) (min-colors 8))
     :background "green"
     :foreground "black")
    (t :inverse-video t))
  "Basic face for ngx."
  :group 'ngx-group)

;;;for ngxhtml end

(defcustom ngxhtml-ts-mode-indent-offset 2
  "Number of spaces for each indentation step in `ngxhtml-ts-mode'."
  :version "29.1"
  :type 'integer
  :safe 'integerp
  :group 'ngxhtml)

(defvar ngxhtml-ts-mode--indent-rules
  `((ngxhtml
     ((parent-is "fragment") column-0 0)
     ((node-is "/>") parent-bol 0)
     ((node-is ">") parent-bol 0)
     ((node-is "end_tag") parent-bol 0)
     ((node-is "}") parent-bol 0) ;;;
     ((parent-is "statement_block")
      parent-bol
      ngxhtml-ts-mode-indent-offset) ;;;
     ((parent-is "comment") prev-adaptive-prefix 0)
     ((parent-is "element") parent-bol ngxhtml-ts-mode-indent-offset)
     ((parent-is "script_element")
      parent-bol
      ngxhtml-ts-mode-indent-offset)
     ((parent-is "style_element")
      parent-bol
      ngxhtml-ts-mode-indent-offset)
     ((parent-is "start_tag")
      parent-bol
      ngxhtml-ts-mode-indent-offset)
     ((parent-is "self_closing_tag")
      parent-bol
      ngxhtml-ts-mode-indent-offset)
     (catch-all parent-bol 0)))
  "Tree-sitter indent rules.")

(defvar ngxhtml-ts-mode--font-lock-settings
  (treesit-font-lock-rules
   :language 'ngxhtml
   :override t
   :feature
   'comment
   `((comment) @font-lock-comment-face)
   :language 'ngxhtml
   :override t
   :feature
   'keyword
   `("doctype" @font-lock-keyword-face)
   :language 'ngxhtml
   :override t
   :feature
   'definition
   `((tag_name) @font-lock-function-name-face)
   :language 'ngxhtml
   :override t
   :feature
   'string
   `((quoted_attribute_value) @font-lock-string-face)
   :language 'ngxhtml
   :override t
   :feature
   'property
   `((attribute_name) @font-lock-variable-name-face)

   ;;;ngx start
   :language 'ngxhtml
   :override t
   :feature
   'id
   `((identifier) @ngx-id-face)
   :language 'ngxhtml
   :override t
   :feature
   'control
   `(["@" @ngx-control-face (control_keyword) @ngx-control-face])
   :language 'ngxhtml
   :override t
   :feature
   'pipe
   `((pipe_call) @ngx-pipe-face)
   :language 'ngxhtml
   :feature
   'bind
   `((["(" @ngx-bind-face "[" @ngx-bind-face "[(" @ngx-bind-face]
      (binding_name)))
   :language 'ngxhtml
   :override t
   :feature
   'bind
   `(((binding_name)
      @ngx-bind-face
      [")" @ngx-bind-face "]" @ngx-bind-face ")]" @ngx-bind-face])))
  ;;;ngx end
  "Tree-sitter font-lock settings for `ngxhtml-ts-mode'.")

(defun ngxhtml-ts-mode--defun-name (node)
  "Return the defun name of NODE.
  Return nil if there is no name or if NODE is not a defun node."
  (when (equal (treesit-node-type node) "tag_name")
    (treesit-node-text node t)))

;;;###autoload
(define-derived-mode
 ngxhtml-ts-mode
 html-mode
 "NGXHTML[ts]"
 "Major mode for editing Ngxhtml, powered by tree-sitter."
 :group 'ngxhtml

 (unless (treesit-ready-p 'ngxhtml)
   (error "Tree-sitter for NGXHTML isn't available"))

 (treesit-parser-create 'ngxhtml)

 ;; Indent.
 (setq-local treesit-simple-indent-rules
             ngxhtml-ts-mode--indent-rules)

 ;; Navigation.
 (setq-local treesit-defun-type-regexp "element")

 (setq-local treesit-defun-name-function
             #'ngxhtml-ts-mode--defun-name)

 (setq-local treesit-thing-settings
             `((ngxhtml
                (sexp
                 ,(regexp-opt
                   '("element" "text" "attribute" "value")))
                (sentence "tag")
                (text ,(regexp-opt '("comment" "text"))))))

 ;; Font-lock.
 (setq-local treesit-font-lock-settings
             ngxhtml-ts-mode--font-lock-settings)
 (setq-local treesit-font-lock-feature-list
             '((comment keyword definition)
               (property string)
               (control pipe bind icu utl sd id)
               ()
               ()))

 ;; Imenu.
 (setq-local treesit-simple-imenu-settings
             '(("Element" "\\`tag_name\\'" nil nil)))

 ;; Outline minor mode.
 (setq-local treesit-outline-predicate "\\`element\\'")
 ;; `ngxhtml-ts-mode' inherits from `ngxhtml-mode' that sets
 ;; regexp-based outline variables.  So need to restore
 ;; the default values of outline variables to be able
 ;; to use `treesit-outline-predicate' above.
 (kill-local-variable 'outline-regexp)
 (kill-local-variable 'outline-heading-end-regexp)
 (kill-local-variable 'outline-level)

 (treesit-major-mode-setup))

(derived-mode-add-parents 'ngxhtml-ts-mode '(html-mode))

(if (treesit-ready-p 'ngxhtml)
    (add-to-list
     'auto-mode-alist '("\\.component.html\\'" . ngxhtml-ts-mode)))

(provide 'ngxhtml-ts-mode)

;;; ngxhtml-ts-mode.el ends here
#+end_src

* Modules
** ~miscellaneous.el~
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-miscellaneous.el" :mkdirp yes
(use-package
 exec-path-from-shell
 :ensure t
 :config
 (when (memq window-system '(mac ns x))
   (exec-path-from-shell-initialize)))
(provide 'tony-emacs-miscellaneous)
#+end_src
** ~visual-fill-column.el~
*** configure and install package
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-visual-fill-column.el" :mkdirp yes
  (use-package visual-fill-column
  :ensure t
  :hook (org-mode . visual-line-mode)
  :init
  (setq-default visual-fill-column-center-text t)
  (setq-default visual-fill-column-width 100)
  (setq-default visual-fill-column-enable-sensible-window-split t)

  (add-hook 'visual-line-mode-hook #'visual-fill-column-for-vline)

  :config
  (advice-add 'text-scale-adjust :after #'visual-fill-column-adjust))
#+end_src
*** provide module
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-visual-fill-column.el" :mkdirp yes
 (provide 'tony-emacs-visual-fill-column)
#+end_src
** ~languages.el~
*** shell
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-languages.el" :mkdirp yes
(use-package
 sh-mode
 :ensure nil ;; built in
 :mode "\\.zsh\\'" "\\.sh\\'")
#+end_src

*** lisp
**** aggressive-indent
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-languages.el" :mkdirp yes
(use-package
 aggressive-indent
 :ensure t
 :hook

 '(clojure-mode
   elisp-mode emacs-lisp-mode lisp-mode common-lisp-mode scheme-mode))
#+end_src

**** smart-parens
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-languages.el" :mkdirp yes
(use-package
 smartparens
 :ensure t
 :hook
 (clojure-mode . smartparens-mode)
 (scheme-mode . smartparens-mode)
 :config (require 'smartparens-config))
#+end_src

**** racket
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-languages.el" :mkdirp yes
  (setq racket-program "/usr/bin/racket")
  (setq org-babel-debug t)

  (use-package
   racket-mode
   :after org
   :ensure t
   :config (add-to-list 'org-babel-load-languages '(racket . t)))
#+end_src

**** paredit
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-languages.el" :mkdirp yes
(use-package
 paredit
 :ensure t
 :hook
 ;; Use the :hook keyword for modern use-package syntax
 (racket-mode-hook . paredit-mode))
#+end_src

*** provide module
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-languages.el" :mkdirp yes
(provide 'tony-emacs-languages)
#+end_src

** ~org.el~
*** org mode setup
Setup org mode basics:
- log done with time
- also logged status updates should be foldable and separate from rest
  of header content
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-org.el" :mkdirp yes
  (use-package
   org
   :ensure nil
   :init
   (setopt org-confirm-babel-evaluate nil)
   (setq org-directory (expand-file-name "~/Documents/org/"))
   (setq org-imenu-depth 7)
   (setq org-log-done 'time)
   (setq org-log-into-drawer t)
   :config
   (setq org-startup-indented t)
   (add-to-list 'org-src-lang-modes '("typescript" . typescript-ts))
   )
#+end_src

*** org agenda set up
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-org.el" :mkdirp yes
  (use-package
    org-agenda
    :ensure nil
    :bind
    (("C-c A" . org-agenda))
    :config (setq org-agenda-files (list org-directory)))
#+end_src

