emacs/.config/emacs/init.el
   (add-to-list 'load-path (locate-user-emacs-file string)))
 '("tony-lisp" "tony-emacs-modules"))

(require 'tony-emacs-miscellaneous)
(require 'tony-emacs-visual-fill-column)
(require 'tony-emacs-org)
(require 'tony-emacs-project)
;;(require 'tony-emacs-treemacs)
(require 'tony-emacs-pulsar)
(require 'tony-emacs-fonts)
(require 'tony-emacs-nerd-icons)
(require 'tony-emacs-tweakers)
(require 'tony-emacs-meow)
(require 'tony-emacs-which-key)
;;(require 'tony-emacs-prot-themes)
;;(require 'tony-emacs-doom-themes)
;;(require 'tony-emacs-solaire-mode)
(require 'tony-emacs-themes)
(require 'tony-emacs-doom-modeline)
;(require 'tony-emacs-textsize)
(require 'tony-emacs-vertico)
(require 'tony-emacs-marginalia)
(require 'tony-emacs-orderless)
(require 'tony-emacs-consult)
(require 'tony-emacs-diff-hl)
(require 'tony-emacs-magit)
(require 'tony-emacs-blamer)
(require 'tony-emacs-denote)
(require 'tony-emacs-completion)
(require 'tony-emacs-spellchecker)
(require 'tony-emacs-linter)
(require 'tony-emacs-prettier)
(require 'tony-emacs-treesit)
(require 'tony-emacs-languages)
(require 'tony-emacs-lsp-mode)
;;(require 'tony-emacs-lsp-treemacs)
(require 'tony-emacs-ngx)
(require 'tony-emacs-lsp-biome)
(require 'tony-emacs-info-manuals)
(require 'tony-emacs-copilot)
(require 'tony-emacs-agent-shell)
(require 'tony-emacs-agent-shell-sidebar)
