emacs/.config/emacs/tony-emacs-modules/tony-emacs-org.el
(use-package
 org
 :ensure nil
 :init
 (setopt org-confirm-babel-evaluate nil)
 (setq org-directory (expand-file-name "~/Documents/org/"))
 (setq org-imenu-depth 7)
 (setq org-log-done 'time)
 (setq org-log-into-drawer t)
 :config
 (setq org-startup-indented t)
 (add-to-list 'org-src-lang-modes '("typescript" . typescript-ts))
 )

(use-package
  org-agenda
  :ensure nil
  :bind
  (("C-c A" . org-agenda))
  :config (setq org-agenda-files (list org-directory)))
