emacs/.config/emacs/my-init.org
*** org alert setup
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-org.el" :mkdirp yes
  ;; (use-package org-alert
  ;;   :ensure t
  ;;   :hook (org-agenda-mode . org-alert-mode))
#+end_src


*** org modern set up
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-org.el" :mkdirp yes
  (use-package
   org-modern
   :ensure t
   :hook (org-mode . org-modern-mode)
   :config
   (setq
    org-modern-keyword nil
    org-modern-block-name nil
    org-modern-timestamp nil
    ))
#+end_src

*** org-modern-indent
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-org.el" :mkdirp yes
(use-package org-modern-indent
  :ensure (:host github :repo "jdtsmith/org-modern-indent")
  :hook
  (org-mode . org-modern-indent-mode))
#+end_src

*** org appear set up
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-org.el" :mkdirp yes
(use-package org-appear :ensure t :hook (org-mode . org-appear-mode))
(setq org-appear-trigger 'always)
#+end_src

*** org-babel setup

**** racket ob-babel 
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-org.el" :mkdirp yes
(use-package ob-racket
  :ensure (:host github :repo "DEADB17/ob-racket"))
#+end_src

*** provide module
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-org.el" :mkdirp yes
(provide 'tony-emacs-org)
#+end_src

** ~denote.el~
*** use and config denote
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-denote.el" :mkdirp yes
(use-package
 denote
 :ensure t
 :demand t
 :init
 :config
 (setq denote-file-type 'org)
 (setq denote-workdir (expand-file-name "~/Documents/org/work-notes"))
 (setq denote-directory (expand-file-name "~/Documents/org/denote"))
 (setq denote-known-keywords
       '("emacs"
         "org mode"
         "denote"
         "game dev"
         "godot"
         "C"
         "lisp"
         "typescript"
         "javascript"
         "angular"
         "ngrx"
         "hand tools"
         "power tools"
         "offroading"
         "preparedness")))
#+end_src
*** use and config denote-journal
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-denote.el" :mkdirp yes
(use-package
 denote-journal
 :ensure t
 :demand t
 :after denote
 :custom
 (denote-journal-directory
  (expand-file-name "journal" denote-directory))
 (denote-journal-title-format 'day-date-month-year)
 (denote-journal-keyword "journal")

 :config
 (with-eval-after-load 'org-capture
   (add-to-list
    'org-capture-templates
    '("ndj"
      "Journal"
      entry
      (file denote-journal-path-to-new-or-existing-entry)
      "* %U\n\n%?"
      :kill-buffer t
      :empty-lines 1)))

 :bind
 (("C-c n j" . denote-journal-new-entry)
  ("C-c n J" . denote-journal-new-or-existing-entry)))
#+end_src

*** use and config denote markdown
possible obsidian usage
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-denote.el" :mkdirp yes
(use-package
 denote-markdown
 ;; TODO There is apparently Obsidian support. Maybe I could create a Silo or
 ;; something that is located at the Obsidian directory. Having the ability to
 ;; link my Obsidian notes with my denote(s) would be really nice. Definitely
 ;; going to look into this.
 :ensure t
 :demand t
 :after denote)
#+end_src

*** use and config denote-silo
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-denote.el" :mkdirp yes
(use-package
 denote-silo
 :ensure t
 :demand t
 :after denote
 :custom
 (denote-silo-directories (list denote-directory denote-workdir))
 :bind
 (("C-c N d" . denote-silo-dired)
  ("C-c N n" . denote-silo-open-or-create)
  ("C-c N N" . denote-silo-select-silo-then-command)
  ("C-c N c" . denote-silo-cd)))
#+end_src

*** use and config denote-explore
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-denote.el" :mkdirp yes
(use-package
 denote-explore
 :ensure t
 :after denote
 :custom
 ;; Where to store network data and in which format
 (denote-explore-network-directory
  (concat denote-directory "/graphs/"))
 (denote-explore-network-filename "denote-network")
 ;; Output format
 (denote-explore-network-format 'graphviz)
 (denote-explore-network-graphviz-filetype "svg")
 ;; Exlude keywords or regex
 (denote-explore-network-keywords-ignore '("bib"))
 :bind
 ( ;; Statistics
  ("C-c n e c" . denote-explore-count-notes)
  ("C-c n e C" . denote-explore-count-keywords)
  ("C-c n e b" . denote-explore-keywords-barchart)
  ("C-c n e x" . denote-explore-extensions-barchart)
  ;; Random walks
  ("C-c n e r" . denote-explore-random-note)
  ("C-c n e l" . denote-explore-random-link)
  ("C-c n e k" . denote-explore-random-keyword)
  ;; Denote Janitor
  ("C-c n e d" . denote-explore-identify-duplicate-notes)
  ("C-c n e z" . denote-explore-zero-keywords)
  ("C-c n e s" . denote-explore-single-keywords)
  ("C-c n e o" . denote-explore-sort-keywords)
  ("C-c n e r" . denote-explore-rename-keywords)
  ;; Visualise denote
  ("C-c n e n" . denote-explore-network)
  ("C-c n e v" . denote-explore-network-regenerate)
  ("C-c n e D" . denote-explore-degree-barchart)))
#+end_src

*** use and config consult denote
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-denote.el" :mkdirp yes
(use-package consult-denote
  :ensure t
  :bind
  (("C-c n c f" . consult-denote-find)
   ("C-c n c g" . consult-denote-grep))

  :custom
  (consult-denote-find-command 'consult-fd)
  (consult-denote-grep-command 'consult-ripgrep)

  :config
  (consult-denote-mode 1))
#+end_src


*** provide module
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-denote.el" :mkdirp yes
(provide 'tony-emacs-denote)
#+end_src

** ~project.el~
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-project.el" :mkdirp yes
(use-package project :ensure nil)
#+end_src

*** provide module
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-project.el" :mkdirp yes
(provide 'tony-emacs-project)
#+end_src

** ~treemacs.el~
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-treemacs.el" :mkdirp yes
;;for treemacs
(use-package
 treemacs
 :ensure t
 :defer t
 :config
 (progn
   (setq
    treemacs-collapse-dirs
    (if treemacs-python-executable
        3
      0)
    treemacs-deferred-git-apply-delay 0.5
    treemacs-directory-name-transformer #'identity
    treemacs-display-in-side-window t
    treemacs-eldoc-display 'simple
    treemacs-file-event-delay 2000
    treemacs-file-extension-regex treemacs-last-period-regex-value
    treemacs-file-follow-delay 0.2
    treemacs-file-name-transformer #'identity
    treemacs-follow-after-init t
    treemacs-expand-after-init t
    treemacs-find-workspace-method 'find-for-file-or-pick-first
    treemacs-git-command-pipe ""
    treemacs-goto-tag-strategy 'refetch-index
    treemacs-header-scroll-indicators '(nil . "^^^^^^")
    treemacs-hide-dot-git-directory t
    treemacs-indentation 2
    treemacs-indentation-string " "
    treemacs-is-never-other-window nil
    treemacs-max-git-entries 5000
    treemacs-missing-project-action 'ask
    treemacs-move-files-by-mouse-dragging t
    treemacs-move-forward-on-expand nil
    treemacs-no-png-images nil
    treemacs-no-delete-other-windows t
    treemacs-project-follow-cleanup nil
    treemacs-persist-file (expand-file-name ".cache/treemacs-persist" user-emacs-directory)
    treemacs-position 'left
    treemacs-read-string-input 'from-child-frame
    treemacs-recenter-distance 0.1
    treemacs-recenter-after-file-follow nil
    treemacs-recenter-after-tag-follow nil
    treemacs-recenter-after-project-jump 'always
    treemacs-recenter-after-project-expand 'on-distance
    treemacs-litter-directories '("/node_modules" "/.venv" "/.cask")
    treemacs-project-follow-into-home nil
    treemacs-show-cursor nil
    treemacs-show-hidden-files t
    treemacs-silent-filewatch nil
    treemacs-silent-refresh nil
    treemacs-sorting 'alphabetic-asc
    treemacs-select-when-already-in-treemacs 'move-back
    treemacs-space-between-root-nodes t
    treemacs-tag-follow-cleanup t
    treemacs-tag-follow-delay 1.5
    treemacs-text-scale nil
    treemacs-user-mode-line-format nil
    treemacs-user-header-line-format nil
    treemacs-wide-toggle-width 70
    treemacs-width 35
    treemacs-width-increment 1
    treemacs-width-is-initially-locked t
    treemacs-workspace-switch-cleanup nil)
   ;; The default width and height of the icons is 22 pixels. If you are
   ;; using a Hi-DPI display, uncomment this to double the icon size.
   ;;(treemacs-resize-icons 44)
   (treemacs-follow-mode t)
   (treemacs-filewatch-mode t)
   (treemacs-fringe-indicator-mode 'always)
   (when treemacs-python-executable
     (treemacs-git-commit-diff-mode t))

   (pcase (cons
           (not (null (executable-find "git")))
           (not (null treemacs-python-executable)))
     (`(t . t) (treemacs-git-mode 'deferred))
     (`(t . _) (treemacs-git-mode 'simple)))

   (treemacs-hide-gitignored-files-mode nil))
 :bind
 (:map
  global-map
  ("M-0" . treemacs-select-window)
  ("C-x t 1" . treemacs-delete-other-windows)
  ("C-x t t" . treemacs)
  ("C-x t d" . treemacs-select-directory)
  ("C-x t B" . treemacs-bookmark)
  ("C-x t C-t" . treemacs-find-file)
  ("C-x t M-t" . treemacs-find-tag)))
(use-package
 treemacs-icons-dired
 :hook (dired-mode . treemacs-icons-dired-enable-once)
 :ensure t)
;;(use-package treemacs-magit
;;  :after (treemacs magit)
;;  :ensure t)
;;(use-package treemacs-persp ;;treemacs-perspective if you use perspective.el vs. persp-mode
;; :after (treemacs persp-mode) ;;or perspective vs. persp-mode
;;  :ensure t
;;  :config (treemacs-set-scope-type 'Perspectives))
;;(use-package treemacs-tab-bar ;;treemacs-tab-bar if you use tab-bar-mode
;;  :after (treemacs)
;;  :ensure t
;;  :config (treemacs-set-scope-type 'Tabs))
(treemacs-start-on-boot)


(provide 'tony-emacs-treemacs)
#+end_src

** ~tweakers.el~

*** use and config anzu
Display number of matches in modeline when searching
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-tweakers.el" :mkdirp yes
(use-package anzu :ensure t :config (global-anzu-mode))
#+end_src

*** use and configure surround
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-tweakers.el" :mkdirp yes
(use-package
 surround
 :ensure t
 :bind-keymap ("C-c s" . surround-keymap))
#+end_src

*** use and configure ultra-scroll
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-tweakers.el" :mkdirp yes
;; (pixel-scroll-precision-mode)
(use-package
 ultra-scroll
 :ensure t
 :init
 (setopt
  scroll-conservatively 3
  scroll-margin 0)
 :config (ultra-scroll-mode 1))
#+end_src

*** provide module
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-tweakers.el" :mkdirp yes
(provide 'tony-emacs-tweakers)
#+end_src

** ~meow.el~
