emacs/.config/emacs/tony-emacs-modules/tony-emacs-org.el

;; (use-package org-alert
;;   :ensure t
;;   :hook (org-agenda-mode . org-alert-mode))

(use-package
 org-modern
 :ensure t
 :hook (org-mode . org-modern-mode)
 :config
 (setq
  org-modern-keyword nil
  org-modern-block-name nil
  org-modern-timestamp nil
  ))

(use-package org-modern-indent
  :ensure (:host github :repo "jdtsmith/org-modern-indent")
  :hook
  (org-mode . org-modern-indent-mode))

(use-package org-appear :ensure t :hook (org-mode . org-appear-mode))
(setq org-appear-trigger 'always)

(use-package ob-racket
  :ensure (:host github :repo "DEADB17/ob-racket"))

(provide 'tony-emacs-org)
