emacs/.config/emacs/my-init.org
*** setup meow config
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-meow.el" :mkdirp yes
(defun meow-setup ()
  (setq meow-cheatsheet-layout meow-cheatsheet-layout-qwerty)
  (meow-motion-overwrite-define-key
   '("j" . meow-next) '("k" . meow-prev) '("<escape>" . ignore))
  (meow-leader-define-key
   ;; SPC j/k will run the original command in MOTION state.
   '("j" . "H-j")
   '("k" . "H-k")
   ;; Use SPC (0-9) for digit arguments.
   '("1" . meow-digit-argument)
   '("2" . meow-digit-argument)
   '("3" . meow-digit-argument)
   '("4" . meow-digit-argument)
   '("5" . meow-digit-argument)
   '("6" . meow-digit-argument)
   '("7" . meow-digit-argument)
   '("8" . meow-digit-argument)
   '("9" . meow-digit-argument)
   '("0" . meow-digit-argument)
   '("/" . meow-keypad-describe-key)
   '("?" . meow-cheatsheet))
  (meow-normal-define-key
   '("0" . meow-expand-0)
   '("9" . meow-expand-9)
   '("8" . meow-expand-8)
   '("7" . meow-expand-7)
   '("6" . meow-expand-6)
   '("5" . meow-expand-5)
   '("4" . meow-expand-4)
   '("3" . meow-expand-3)
   '("2" . meow-expand-2)
   '("1" . meow-expand-1)
   '("-" . negative-argument)
   '(";" . meow-reverse)
   '("," . meow-inner-of-thing)
   '("." . meow-bounds-of-thing)
   '("[" . meow-beginning-of-thing)
   '("]" . meow-end-of-thing)
   '("a" . meow-append)
   '("A" . meow-open-below)
   '("b" . meow-back-word)
   '("B" . meow-back-symbol)
   '("c" . meow-change)
   '("d" . meow-delete)
   '("D" . meow-backward-delete)
   '("e" . meow-next-word)
   '("E" . meow-next-symbol)
   '("f" . meow-find)
   '("g" . meow-cancel-selection)
   '("G" . meow-grab)
   '("h" . meow-left)
   '("H" . meow-left-expand)
   '("i" . meow-insert)
   '("I" . meow-open-above)
   '("j" . meow-next)
   '("J" . meow-next-expand)
   '("k" . meow-prev)
   '("K" . meow-prev-expand)
   '("l" . meow-right)
   '("L" . meow-right-expand)
   '("m" . meow-join)
   '("n" . meow-search)
   '("o" . meow-block)
   '("O" . meow-to-block)
   '("p" . meow-yank)
   '("q" . meow-quit)
   '("Q" . meow-goto-line)
   '("r" . meow-replace)
   '("R" . meow-swap-grab)
   '("s" . meow-kill)
   '("t" . meow-till)
   '("u" . meow-undo)
   '("U" . meow-undo-in-selection)
   '("v" . meow-visit)
   '("w" . meow-mark-word)
   '("W" . meow-mark-symbol)
   '("x" . meow-line)
   '("X" . meow-goto-line)
   '("y" . meow-save)
   '("Y" . meow-clipboard-save)
   '("z" . meow-pop-selection)
   '("'" . repeat)
   '("<escape>" . ignore)))
#+end_src

*** start up meow package
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-meow.el" :mkdirp yes
(use-package meow :ensure t :config (meow-setup) (meow-global-mode 1))
#+end_src

*** provide module
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-meow.el" :mkdirp yes
(provide 'tony-emacs-meow)
#+end_src

** ~which-key.el~
*** setup which key
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-which-key.el" :mkdirp yes
(use-package which-key :ensure t :config (which-key-mode))
#+end_src

*** provide module
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-which-key.el" :mkdirp yes
(provide 'tony-emacs-which-key)
#+end_src
** ~themes.el~
*** Themes directory

#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-themes.el" :mkdirp yes
(setopt custom-theme-directory "~/.config/emacs/themes/")
#+end_src
*** Set custom themes safe

#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-themes.el" :mkdirp yes
(setq custom-safe-themes t)
#+end_src
*** Hooks

#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-themes.el" :mkdirp yes
(add-hook 'after-make-frame-functions #'my-load-theme-in-all-frames)
#+end_src
*** Modus themes

#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-themes.el" :mkdirp yes
  (use-package modus-themes
    :ensure t)
#+end_src

*** Ef themes

#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-themes.el" :mkdirp yes
(use-package ef-themes
 :ensure t
    )
#+end_src

*** Standard themes

#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-themes.el" :mkdirp yes
  (use-package standard-themes
  :ensure t)
#+end_src

*** Doric themes

#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-themes.el" :mkdirp yes
(use-package
 doric-themes
 :ensure t
 :custom (doric-themes-toggle '(doric-light doric-obsidian)))
#+end_src

*** Doom

#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-themes.el" :mkdirp yes
(use-package
 doom-themes
 :ensure t
 :init
 (defun my-rose-pine ()
   "Clear previous theme and load rosé pine."
   (interactive)
   (my-load-theme 'doom-rose-pine))

 (defun my-rose-pine-dawn ()
   "Clear previous theme and load rosé pine dawn."
   (interactive)
   (my-load-theme 'doom-rose-pine-dawn))

 (defun my-doom-one ()
   "Clear previous theme and load doom-one."
   (interactive)
   (my-load-theme 'doom-one))

 (defun my-gruvbox ()
   "Clear previous theme and load gruvbox."
   (interactive)
   (my-load-theme 'doom-gruvbox))

 (defun my-gruvbox-light ()
   "Clear previous theme and load gruvbox."
   (interactive)
   (my-load-theme 'doom-gruvbox-light))

 (defun my-toggle-rose-pine ()
   "Toggle between light and dark Rosé Pine themes."
   (interactive)
   (if (eq (nth 0 custom-enabled-themes) 'doom-rose-pine)
       (my-rose-pine-dawn)
     (my-rose-pine)))

 (defun my-toggle-gruvbox ()
   "Toggle between light and dark Gruvbox themes."
   (interactive)
   (if (eq (nth 0 custom-enabled-themes) 'doom-gruvbox)
       (my-gruvbox-light)
     (my-gruvbox)))

 (defun my-toggle-tomorrow ()
   "Toggle between light and dark Tomorrow themes."
   (interactive)
   (if (eq (nth 0 custom-enabled-themes) 'doom-tomorrow-night)
       (my-load-theme 'doom-tomorrow-day)
     (my-load-theme 'doom-tomorrow-night)))
 :custom (doom-themes-enable-bold t) (doom-themes-enable-italic t)
 :config (doom-themes-org-config))
#+end_src

*** Naysayer

Based on theme from Jonathan Blow's livestreams.

#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-themes.el" :mkdirp yes
(use-package
 naysayer-theme
 :ensure t
 :init
 (defun my-naysayer-theme ()
   "Clear previous theme and load naysayer."
   (interactive)
   (my-load-theme 'naysayer)))
#+end_src

*** Acme theme

Inspired by Plan 9 Acme & Sam.

#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-themes.el" :mkdirp yes
(use-package
 acme-theme
 :ensure t
 :init (setq acme-theme-black-fg t)

 (defun my-acme-theme ()
   "Clear previous theme and load acme."
   (interactive)
   (my-load-theme 'acme)))
#+end_src

*** Kaolin

#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-themes.el" :mkdirp yes
(use-package
 kaolin-themes
 :ensure t
 :init
 (defun my-kaolin-dark ()
   "Clear previous theme and load kaolin dark."
   (interactive)
   (my-load-theme 'kaolin-dark))

 (defun my-kaolin-light ()
   "Clear previous theme and load kaolin light."
   (interactive)
   (my-load-theme 'kaolin-light))

 (defun my-kaolin-mono-dark ()
   "Clear previous theme and load kaolin mono dark."
   (interactive)
   (my-load-theme 'kaolin-mono-dark))

 (defun my-kaolin-mono-light ()
   "Clear previous theme and load kaolin mono light."
   (interactive)
   (my-load-theme 'kaolin-mono-light)))
#+end_src

*** Solarized

#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-themes.el" :mkdirp yes
  (defun my-toggle-solarized ()
    "Toggle between light and dark solarized themes."
    (interactive)
    (if (eq (nth 0 custom-enabled-themes) 'doom-solarized-dark)
        (my-solarized-light)
      (my-solarized-dark)))

  (defun my-solarized-light ()
    "Clear previous theme and load solarized light"
    (interactive)
    (my-load-theme 'doom-solarized-light))

  (defun my-solarized-dark ()
    "Clear previous theme and load solarized dark"
    (interactive)
    (my-load-theme 'doom-solarized-dark))
#+end_src

*** Functions
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-themes.el" :mkdirp yes
  (use-package remember-last-theme
    :after (acme-theme kaolin-themes naysayer-theme doom-themes doric-themes standard-themes ef-themes modus-themes)
    :config
    (remember-theme-load)
    (add-hook 'kill-emacs-hook 'remember-theme-save)
    )
#+end_src

*** Provide module
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-themes.el" :mkdirp yes
(provide 'tony-emacs-themes)
#+end_src

** ~solaire-mode.el~
*** use and config solaire mode
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-solaire-mode.el" :mkdirp yes
(use-package solaire-mode :ensure t :config (solaire-global-mode +1))
#+end_src

*** provide module
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-solaire-mode.el"
(provide 'tony-emacs-solaire-mode)
#+end_src

** ~doom-modeline.el~
*** use and config doom modeline
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-doom-modeline.el" :mkdirp yes
(use-package doom-modeline :ensure t :init (doom-modeline-mode 1))
#+end_src

*** provide module
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-doom-modeline.el" :mkdirp yes
(provide 'tony-emacs-doom-modeline)
#+end_src

** ~textsize.el~
*** use and config textsize
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-textsize.el" :mkdirp yes
(use-package
 textsize
 :ensure t
 :init (textsize-mode)
 ;; Can set macOS specific font size if necessary
 :custom
 (textsize-default-points
  (if (eq system-type 'darwin)
      15
    15))
 :config (textsize-fix-frame)
 (customize-set-variable
  'textsize-monitor-size-thresholds
  '((0 . -3) (340 . 0) (600 . -1) (900 . 6) (1200 . 9)))
 (customize-set-variable
  'textsize-pixel-pitch-thresholds '((0 . 15) (.08 . 15) (0.11 . 0))))
#+end_src

