emacs/.config/emacs/tony-emacs-modules/tony-emacs-textsize.el
(use-package
 textsize
 :ensure t
 :init (textsize-mode)
 ;; Can set macOS specific font size if necessary
 :custom
 (textsize-default-points
  (if (eq system-type 'darwin)
      15
    15))
 :config (textsize-fix-frame)
 (customize-set-variable
  'textsize-monitor-size-thresholds
  '((0 . -3) (340 . 0) (600 . -1) (900 . 6) (1200 . 9)))
 (customize-set-variable
  'textsize-pixel-pitch-thresholds '((0 . 15) (.08 . 15) (0.11 . 0))))
