emacs/.config/emacs/my-init.org
*** use and config treesit
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-treesit.el" :mkdirp yes
(use-package
 treesit
 :mode
 (("\\.component.html\\'" . ngxhtml-ts-mode)
  ;;("\\.html\\'"  . html-ts-mode)
  ("\\.js\\'" . typescript-ts-mode)
  ("\\.mjs\\'" . typescript-ts-mode)
  ("\\.mts\\'" . typescript-ts-mode)
  ("\\.cjs\\'" . typescript-ts-mode)
  ("\\.ts\\'" . typescript-ts-mode)
  ("\\.jsx\\'" . tsx-ts-mode)
  ("\\.json\\'" . json-ts-mode)
  ("\\.Dockerfile\\'" . dockerfile-ts-mode)
  ("\\.prisma\\'" . prisma-ts-mode)
  ("\\.yaml\\'" . yaml-ts-mode)
  ;; More modes defined here...
  )
 :preface
 (defun tb/setup-install-grammars ()
   "Install Tree-sitter grammars if they are absent."
   (interactive)
   (dolist
       (grammar
        '((css . ("https://github.com/tree-sitter/tree-sitter-css"))
          (bash "https://github.com/tree-sitter/tree-sitter-bash")
          (html "https://github.com/tree-sitter/tree-sitter-html")
          (angular
           "https://github.com/dlvandenberg/tree-sitter-angular")
          (javascript
           .
           ("https://github.com/tree-sitter/tree-sitter-javascript"))
          (json . ("https://github.com/tree-sitter/tree-sitter-json"))
          (python
           . ("https://github.com/tree-sitter/tree-sitter-python"))
          (markdown
           "https://github.com/ikatyang/tree-sitter-markdown")
          (make "https://github.com/alemuller/tree-sitter-make")
          (elisp "https://github.com/Wilfred/tree-sitter-elisp")
          (cmake "https://github.com/uyha/tree-sitter-cmake")
          (c "https://github.com/tree-sitter/tree-sitter-c")
          (gdscript
           "https://github.com/PrestonKnopp/tree-sitter-gdscript")
          (cpp "https://github.com/tree-sitter/tree-sitter-cpp")
          (toml
           .
           ("https://github.com/tree-sitter/tree-sitter-toml"
            "v0.5.1"))
          (tsx
           .
           ("https://github.com/tree-sitter/tree-sitter-typescript"
            "v0.20.3"
            "tsx/src"))
          (typescript
           .
           ("https://github.com/tree-sitter/tree-sitter-typescript"
            "v0.20.3"
            "typescript/src"))
          (yaml . ("https://github.com/ikatyang/tree-sitter-yaml"))
          (prisma "https://github.com/victorhqc/tree-sitter-prisma")))
     (add-to-list 'treesit-language-source-alist grammar)
     ;; Only install `grammar' if we don't already have it
     ;; installed. However, if you want to *update* a grammar then
     ;; this obviously prevents that from happening.
     (unless (treesit-language-available-p (car grammar))
       (treesit-install-language-grammar (car grammar)))))

 ;; Optional, but recommended. Tree-sitter enabled major modes are
 ;; distinct from their ordinary counterparts.
 ;;
 ;; You can remap major modes with `major-mode-remap-alist'. Note
 ;; that this does *not* extend to hooks! Make sure you migrate them
 ;; also
 (dolist (mapping
          '((python-mode . python-ts-mode)
            (css-mode . css-ts-mode)
            (typescript-mode . typescript-ts-mode)
            (js-mode . typescript-ts-mode)
            (js2-mode . typescript-ts-mode)
            (c-mode . c-ts-mode)
            (c++-mode . c++-ts-mode)
            (c-or-c++-mode . c-or-c++-ts-mode)
            (bash-mode . bash-ts-mode)
            (css-mode . css-ts-mode)
            (json-mode . json-ts-mode)
            (js-json-mode . json-ts-mode)
            (sh-mode . bash-ts-mode)
            (sh-base-mode . bash-ts-mode)))
   (add-to-list 'major-mode-remap-alist mapping))
 :config (tb/setup-install-grammars) (setq treesit-font-lock-level 6))

(provide 'tony-emacs-treesit)
#+end_src

** ~linter.el~

*** flycheck use and config
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-linter.el" :mkdirp yes
(use-package
 flycheck
 :ensure t
 :init (global-flycheck-mode)
 :bind
 (:map
  flycheck-mode-map
  ("M-n" . flycheck-next-error) ; optional but recommended error navigation
  ("M-p" . flycheck-previous-error)))
#+end_src

*** editorconfig use and config
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-linter.el" :mkdirp yes
(use-package editorconfig
  :ensure t
  :config (editorconfig-mode 1))
#+end_src

*** provide module
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-linter.el" :mkdirp yes
(provide 'tony-emacs-linter)
#+end_src

** ~spellchecker.el~
- Arch dependencies: 
#+begin_src sh
  pacman -S hunspell hunspell-en_us pkgconf
#+end_src
-macOS dependencies:
#+begin_src sh
  brew install enchant hunspell
#+end_src

*** use and configure jinx
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-spellchecker.el" :mkdirp yes
(use-package
 jinx
 :ensure t
 :hook (emacs-startup . global-jinx-mode)
 :bind (("M-$" . jinx-correct) ("C-M-$" . jinx-languages)))
#+end_src

*** provide module
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-spellchecker.el" :mkdirp yes
(provide 'tony-emacs-spellchecker)
#+end_src

** ~prettier.el~
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-prettier.el" :mkdirp yes
;; auto-format different source code files extremely intelligently
;; https://github.com/radian-software/apheleia
(use-package elisp-autofmt :ensure t)

(use-package
 apheleia
 :ensure t
 :diminish
 :config (apheleia-global-mode 1)

 ;; Configure prettierd formatter
 (setf (alist-get 'prettierd apheleia-formatters)
       '("prettierd" "--stdin-filepath" filepath))
 ;; Update mode associations to use prettierd instead of prettier
 (setf (alist-get 'js-mode apheleia-mode-alist) 'prettierd)
 (setf (alist-get 'js-ts-mode apheleia-mode-alist) 'prettierd)
 (setf (alist-get 'typescript-mode apheleia-mode-alist) 'prettierd)
 (setf (alist-get 'typescript-ts-mode apheleia-mode-alist) 'prettierd)
 (setf (alist-get 'tsx-ts-mode apheleia-mode-alist) 'prettierd)
 (setf (alist-get 'json-mode apheleia-mode-alist) 'prettierd)
 (setf (alist-get 'json-ts-mode apheleia-mode-alist) 'prettierd)
 (setf (alist-get 'css-mode apheleia-mode-alist) 'prettierd)
 (setf (alist-get 'scss-mode apheleia-mode-alist) 'prettierd)
 (setf (alist-get 'css-ts-mode apheleia-mode-alist) 'prettierd)
 (setf (alist-get 'html-mode apheleia-mode-alist) 'prettierd)
 (setf (alist-get 'web-mode apheleia-mode-alist) 'prettierd)
 (setf (alist-get 'ngxhtml-ts-mode apheleia-mode-alist) 'prettierd)
 (setf (alist-get 'emacs-lisp-mode apheleia-mode-alist)
       'elisp-autofmt))

(provide 'tony-emacs-prettier)
#+end_src

** ~lsp-biome.el~
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-lsp-biome.el" :mkdirp yes
(use-package
 lsp-biome
 :after apheleia
 :ensure (:host github :repo "cxa/lsp-biome"))
(provide 'tony-emacs-lsp-biome)
#+end_src

** ~completion.el~
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-completion.el" :mkdirp yes
;;;; Code Completion
(use-package
 corfu
 :ensure t
 ;; Optional customizations
 :custom
 (corfu-cycle t) ; Allows cycling through candidates
 (corfu-auto t) ; Enable auto completion
 (corfu-auto-prefix 2) ; Minimum length of prefix for completion
 (corfu-auto-delay 0) ; No delay for completion
 (corfu-popupinfo-delay '(0.5 . 0.2)) ; Automatically update info popup after that numver of seconds
 (corfu-preview-current 'insert) ; insert previewed candidate
 (corfu-preselect 'prompt)
 (corfu-on-exact-match nil) ; Don't auto expand tempel snippets
 ;; Optionally use TAB for cycling, default is `corfu-complete'.
 :bind
 (:map
  corfu-map
  ("M-SPC" . corfu-insert-separator)
  ("TAB" . corfu-next)
  ([tab] . corfu-next)
  ("S-TAB" . corfu-previous)
  ([backtab] . corfu-previous)
  ("S-<return>" . corfu-insert)
  ("RET" . corfu-insert))

 :init (global-corfu-mode) (corfu-history-mode)
 (corfu-popupinfo-mode) ; Popup completion info
 :config
 (add-hook 'eshell-mode-hook
           (lambda ()
             (setq-local
              corfu-quit-at-boundary t
              corfu-quit-no-match t
              corfu-auto nil)
             (corfu-mode))
           nil t))
(provide 'tony-emacs-completion)
#+end_src

** ~lsp-mode.el~
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-lsp-mode.el" :mkdirp yes
    ;; taken from github.com/yolksys
(use-package
 lsp-mode
 :diminish "LSP"
 :ensure t
 :hook
 ((lsp-mode . lsp-diagnostics-mode)
  (lsp-mode . lsp-enable-which-key-integration)
  ((html-ts-mode typescript-ts-mode go-ts-mode js-ts-mode)
   .
   lsp-deferred))
 :custom
 (lsp-keymap-prefix "C-l") ; Prefix for LSP actions
 (lsp-completion-provider :none) ; Using company as the provider
 (lsp-diagnostics-provider :flycheck)
 (lsp-session-file (locate-user-emacs-file ".lsp-session"))
 (lsp-log-io nil) ; IMPORTANT! Use only for debugging! Drastically affects performance
 (lsp-keep-workspace-alive nil) ; Close LSP server if all project buffers are closed
 (lsp-idle-delay 0.5) ; Debounce timer for `after-change-function'
 ;; core
 (lsp-enable-xref nil) ; Use xref to find references
 (lsp-auto-configure t) ; Used to decide between current active servers
 (lsp-eldoc-enable-hover t) ; Display signature information in the echo area
 (lsp-enable-dap-auto-configure t) ; Debug support
 (lsp-enable-file-watchers nil)
 (lsp-enable-folding nil) ; I disable folding since I use origami
 (lsp-enable-imenu t)
 (lsp-enable-indentation nil) ; I use prettier
 (lsp-enable-links nil) ; No need since we have `browse-url'
 (lsp-enable-on-type-formatting nil) ; Prettier handles this
 (lsp-enable-suggest-server-download t) ; Useful prompt to download LSP providers
 (lsp-enable-symbol-highlighting t) ; Shows usages of symbol at point in the current buffer
 (lsp-enable-text-document-color nil) ; This is Treesitter's job

 (lsp-ui-sideline-show-hover nil) ; Sideline used only for diagnostics
 (lsp-ui-sideline-diagnostic-max-lines 20) ; 20 lines since typescript errors can be quite big
 ;; completion
 (lsp-completion-enable t)
 (lsp-completion-enable-additional-text-edit t) ; Ex: auto-insert an import for a completion candidate
 (lsp-enable-snippet t) ; Important to provide full JSX completion
 (lsp-completion-show-kind t) ; Optional
 ;; headerline
 (lsp-headerline-breadcrumb-enable t) ; Optional, I like the breadcrumbs
 (lsp-headerline-breadcrumb-enable-diagnostics t) ; make them red
 (lsp-headerline-breadcrumb-enable-symbol-numbers nil)
 (lsp-headerline-breadcrumb-icons-enable nil)
 ;; modeline
 (lsp-modeline-code-actions-enable nil) ; Modeline should be relatively clean
 (lsp-modeline-diagnostics-enable t) ; Already supported through `flycheck'
 (lsp-modeline-workspace-status-enable nil) ; Modeline displays "LSP" when lsp-mode is enabled
 (lsp-signature-doc-lines 1) ; Don't raise the echo area. It's distracting
 (lsp-ui-doc-use-childframe t) ; Show docs for symbol at point
 (lsp-eldoc-render-all nil) ; This would be very useful if it would respect `lsp-signature-doc-lines', currently it's distracting
 ;; lens
 (lsp-lens-enable nil) ; Optional, I don't need it
 ;; semantic
 (lsp-semantic-tokens-enable nil) ; Related to highlighting, and we defer to treesitter

 :preface
 (defun lsp-booster--advice-json-parse (old-fn &rest args)
   "Try to parse bytecode instead of json."
   (or (when (equal (following-char) ?#)

         (let ((bytecode (read (current-buffer))))
           (when (byte-code-function-p bytecode)
             (funcall bytecode))))
       (apply old-fn args)))
 (defun lsp-booster--advice-final-command (old-fn cmd &optional test?)
   "Prepend emacs-lsp-booster command to lsp CMD."
   (let ((orig-result (funcall old-fn cmd test?)))
     (if (and
          (not test?) ;; for check lsp-server-present?
          (not (file-remote-p default-directory)) ;; see lsp-resolve-final-command, it would add extra shell wrapper
          lsp-use-plists
          (not (functionp 'json-rpc-connection)) ;; native json-rpc
          (executable-find "emacs-lsp-booster"))
         (progn
           (message "Using emacs-lsp-booster for %s!" orig-result)
           (cons "emacs-lsp-booster" orig-result))
       orig-result)))
 ;; Initiate https://github.com/blahgeek/emacs-lsp-booster for performance
 (advice-add
  (if (progn
        (require 'json)
        (fboundp 'json-parse-buffer))
      'json-parse-buffer
    'json-read)
  :around #'lsp-booster--advice-json-parse)
 (advice-add
  'lsp-resolve-final-command
  :around #'lsp-booster--advice-final-command)
 ;;:init
 ;;(setq lsp-use-plists t)
 )

(use-package
 lsp-completion
 :no-require
 :hook ((lsp-mode . lsp-completion-mode)))

(use-package
 lsp-ui
 :ensure t
 :commands (lsp-ui-doc-show lsp-ui-doc-glance)
 :bind (:map lsp-mode-map ("C-c C-d" . 'lsp-ui-doc-glance))
 :after (lsp-mode)
 :config
 (setq
  lsp-ui-doc-enable t
  lsp-ui-doc-show-with-cursor nil ; Don't show doc when cursor is over symbol - too distracting
  lsp-ui-doc-include-signature t ; Show signature
  lsp-ui-doc-position 'at-point))


;; init.el
;;;; per https://github.com/emacs-lsp/lsp-mode#performance
(setq read-process-output-max (* 10 1024 1024)) ;; 10mb
(setq gc-cons-threshold 200000000)

;;(add-to-list 'warning-suppress-log-types '(lsp-mode))
;;(add-to-list 'warning-suppress-types '(lsp-mode))
(provide 'tony-emacs-lsp-mode)
#+end_src

** ~lsp-treemacs.el~
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-lsp-treemacs.el" :mkdirp yes
(use-package
 lsp-treemacs
 :ensure t
 :commands lsp-treemacs-errors-list)
(provide 'tony-emacs-lsp-treemacs)
#+end_src

