emacs/.config/emacs/my-init.org
** ~ngx.el~
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-ngx.el" :mkdirp yes
;;; lsp-ngx.el --- description -*- lexical-binding: t; -*-

;; Copyright (C) 2020 emacs-lsp maintainers

;; Author: emacs-lsp maintainers
;; Keywords: lsp,

;; This program is free software; you can redistribute it and/or modify
;; it under the terms of the GNU General Public License as published by
;; the Free Software Foundation, either version 3 of the License, or
;; (at your option) any later version.

;; This program is distributed in the hope that it will be useful,
;; but WITHOUT ANY WARRANTY; without even the implied warranty of
;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
;; GNU General Public License for more details.

;; You should have received a copy of the GNU General Public License
;; along with this program.  If not, see <https://www.gnu.org/licenses/>.

;;; Commentary:

;; LSP Clients for the ngx Web application framework.

;;; Code:


(use-package ngxhtml-ts-mode)

(add-hook 'ngxhtml-ts-mode-hook #'lsp-deferred)

;;; for formatter
;;(push '(prettier-ngxhtml . ( "apheleia-npx" "prettier" "--stdin-filepath" filepath
;;"--parser=angular"
;;(apheleia-formatters-js-indent "--use-tabs"
;;"--tab-width")))
;;apheleia-formatters)
;;(push '(ngxhtml-ts-mode . prettier-ngxhtml)
;;apheleia-mode-alist)
;;; uncomment this to disable formater
;;;(defun ngxhtml-setting-hooks ()
;;;  (apheleia-mode -1))
;;;(add-hook 'ngxhtml-ts-mode-hook #'ngxhtml-setting-hooks)

;;;(defvar-local node-path (shell-command-to-string "which node"))
(with-eval-after-load 'lsp-mode
  ;;; ngx
  (defgroup lsp-ngx nil
    "ngx LSP client, provided by the ngx Language Service Server."
    :group 'lsp-mode
    :version "8.0.0"
    :link '(url-link "https://github.com/ngx/vscode-ng-language-service"))

  (defcustom lsp-clients-ngx-language-server-command nil
    "The command that starts the ngx language server."
    :group 'lsp-ngx
    :type
    '(choice
      (string :tag "Single string value")
      (repeat :tag "List of string values" string)))

  (defcustom lsp-clients-ngx-node-get-prefix-command
    "npm config get --global prefix"
    "The shell command that returns the path of NodeJS's prefix.
    Has no effects when `lsp-clients-ngx-language-server-command' is set."
    :group 'lsp-ngx
    :type 'string)

  (defun lsp-client--ngx-start-loading (_workspace params)
    (lsp--info "Started loading project %s" params))

  (defun lsp-client--ngx-finished-loading (_workspace params)
    (lsp--info "Finished loading project %s" params))

  (lsp-register-client
   (make-lsp-client
    :new-connection
    (lsp-stdio-connection
     (lambda ()
       (if lsp-clients-ngx-language-server-command
           lsp-clients-ngx-language-server-command
         (let ((node-modules-path
                (f-join
                 (string-trim
                  (shell-command-to-string
                   lsp-clients-ngx-node-get-prefix-command))
                 (if (eq system-type 'windows-nt)
                     "node_modules"
                   "lib/node_modules"))))
           ;; The shell command takes a significant time to run,
           ;; so we "cache" its results after running once
           (setq lsp-clients-ngx-language-server-command
                 (list
                  "ngserver"
                  "--stdio"
                  "--tsProbeLocations"
                  node-modules-path
                  "--ngProbeLocations"
                  (f-join
                   node-modules-path
                   "@ngx/language-server/node_modules/")))
           lsp-clients-ngx-language-server-command))))
    :activation-fn

    (lambda (&rest _args)
      (and
       (string-match-p "\\(\\.html\\|\\.ts\\)\\'" (buffer-file-name))
       (lsp-workspace-root)
       ;; Use 'or' to check for either 'angular.json' or the '.angular' directory
       (or (file-exists-p
            (f-join (lsp-workspace-root) "angular.json"))
           (file-directory-p
            (f-join (lsp-workspace-root) ".angular")))))
    :priority -1
    :notification-handlers
    (ht
     ("angular/projectLoadingStart" #'lsp-client--ngx-start-loading)
     ("angular/projectLoadingFinish"
      #'lsp-client--ngx-finished-loading)
     ("angular/projectLanguageService" #'ignore))
    :add-on? t
    :server-id 'ngx-ls))


  (lsp-consistency-check lsp-ngx)

  ;;;
  ;;;(with-eval-after-load 'lsp-mode
  ;;;  (add-to-list 'lsp-language-id-configuration
  ;;;               '(ngxhtml-ts-mode . "ngxhtml"))
  ;;;
  ;;;  (lsp-register-client
  ;;;   (make-lsp-client :new-connection
  ;;;                    (lsp-stdio-connection
  ;;;                     '("node"
  ;;;                       "/home/cyf/.nvm/versions/node/v23.8.0/lib/node_modules/@angular/language-server"
  ;;;                       "--ngProbeLocations"
  ;;;                       "/home/cyf/.nvm/versions/node/v23.8.0/lib/node_modules"
  ;;;                       "--tsProbeLocations"
  ;;;                       "/home/cyf/.nvm/versions/node/v23.8.0/lib/node_modules/"
  ;;;                       "--stdio"))
  ;;;                    :activation-fn (lsp-activate-on "ngxhtml")
  ;;;                    :server-id 'ngxhtml-ls
  ;;;		   :notification-handlers (ht ("angular/projectLoadingStart" #'ignore)
  ;;;                                               ("angular/projectLoadingFinish" #'ignore)))))
  )
(provide 'tony-emacs-ngx)
;;; tony-emacs-ngx.el ends here
#+end_src

** ~info-manuals.el~

*** use and configure sicp
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-info-manuals.el" :mkdirp yes
(use-package sicp :ensure t)
#+end_src
*** provide module
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-info-manuals.el" :mkdirp yes
(provide 'tony-emacs-info-manuals)
#+end_src

** ~copilot.el~
GitHub Copilot inline completions via [[https://github.com/copilot-emacs/copilot.el][copilot-emacs/copilot.el]].
Run ~M-x copilot-login~ once to authenticate with your GitHub account.

*** use and config copilot with nerd-icons
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-copilot.el" :mkdirp yes
;; copilot requires track-changes >= 1.4
(use-package track-changes :ensure t)

(use-package copilot
  :ensure (:host github :repo "copilot-emacs/copilot.el")
  :after track-changes
  :hook (prog-mode . copilot-mode)
  :bind
  (:map copilot-completion-map
        ("<tab>"   . copilot-accept-completion)
        ("TAB"     . copilot-accept-completion)
        ("C-TAB"   . copilot-accept-completion-by-word)
        ("C-<tab>" . copilot-accept-completion-by-word)
        ("M-n"     . copilot-next-completion)
        ("M-p"     . copilot-previous-completion))
  :custom
  (copilot-idle-delay 0.5)
  (copilot-max-char -1)
  :config
  ;; Show a nerd-icons Copilot indicator in the mode-line
  (with-eval-after-load 'nerd-icons
    (defun tony/copilot-mode-line-indicator ()
      (when (bound-and-true-p copilot-mode)
        (concat " " (nerd-icons-faicon "nf-fa-github") " Copilot")))
    (add-to-list 'global-mode-string
                 '(:eval (tony/copilot-mode-line-indicator)))))
#+end_src

*** provide module
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-copilot.el" :mkdirp yes
(provide 'tony-emacs-copilot)
#+end_src

** ~agent-shell.el~
LLM agent shell via [[https://github.com/xenodium/agent-shell][xenodium/agent-shell]], using the Agent Client Protocol
(ACP) to talk to Claude Code, Gemini CLI, and others directly from Emacs.

Authentication uses your existing Claude Code login — no separate API key needed.
Just ensure ~claude~ is installed and authenticated (~claude~ works in your terminal).

System dependency — install the ACP bridge for Claude Code:
#+begin_src sh
npm install -g @anthropic-ai/claude-code-agent-acp
#+end_src

*** use and config agent-shell
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-agent-shell.el" :mkdirp yes
(use-package shell-maker :ensure t)

(use-package acp :ensure t :after shell-maker)

(use-package agent-shell
  :ensure t
  :after (shell-maker acp)
  :bind
  (("C-c a a" . agent-shell)
   ("C-c a c" . agent-shell-anthropic-start-claude-code))
  :config
  ;; Inherit the current Emacs process environment so the claude binary
  ;; in PATH (and nvm, etc.) is visible to the agent subprocess
  (setq agent-shell-anthropic-claude-environment
        (agent-shell-make-environment-variables
         :inherit-env t)))
#+end_src

*** provide module
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-agent-shell.el" :mkdirp yes
(provide 'tony-emacs-agent-shell)
#+end_src

** ~agent-shell-sidebar.el~
Persistent project-aware sidebar for [[https://github.com/xenodium/agent-shell][agent-shell]], providing a treemacs-style
side panel. Each project gets its own independent sidebar with separate state.

Keybinds extend the existing =C-c a= prefix:
- =C-c a a= → ~agent-shell~
- =C-c a c= → ~agent-shell-anthropic-start-claude-code~
- =C-c a s= → ~agent-shell-sidebar-toggle~
- =C-c a f= → ~agent-shell-sidebar-toggle-focus~

*** use and config agent-shell-sidebar
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-agent-shell-sidebar.el" :mkdirp yes
(use-package agent-shell-sidebar
  :ensure (:host github :repo "cmacrae/agent-shell-sidebar")
  :bind
  (("C-c a s" . agent-shell-sidebar-toggle)
   ("C-c a f" . agent-shell-sidebar-toggle-focus))
  :custom
  (agent-shell-sidebar-width "25%")
  (agent-shell-sidebar-minimum-width 80)
  (agent-shell-sidebar-maximum-width "50%")
  (agent-shell-sidebar-position 'right)
  (agent-shell-sidebar-locked t)
  (agent-shell-sidebar-default-config
   (agent-shell-anthropic-make-claude-code-config)))
#+end_src

*** provide module
#+begin_src emacs-lisp :tangle "tony-emacs-modules/tony-emacs-agent-shell-sidebar.el" :mkdirp yes
(provide 'tony-emacs-agent-shell-sidebar)
#+end_src
